Revit 2027 API
MetallicPaint Properties
The MetallicPaint type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "MetallicPaint" schema.
CommonTintToggle |  The property labeled "Tint" from the "MetallicPaint" schema.
MetallicpaintBaseColor |  The property labeled "Color" from the "MetallicPaint" schema.
MetallicpaintBaseColorByObject |  The property labeled "Color By Object" from the "MetallicPaint" schema.
MetallicpaintBaseHighlightspread |  The property labeled "Highlight Spread" from the "MetallicPaint" schema.
MetallicpaintFinish |  The property labeled "Finish" from the "MetallicPaint" schema.
MetallicpaintFinishPeelamount |  The property labeled "Amount" from the "MetallicPaint" schema.
MetallicpaintFlecks |  The property labeled "Flecks" from the "MetallicPaint" schema.
MetallicpaintFlecksColor |  The property labeled "Color" from the "MetallicPaint" schema.
MetallicpaintFlecksColorByObject |  The property labeled "Color By Object" from the "MetallicPaint" schema.
MetallicpaintFlecksSize |  The property labeled "Size" from the "MetallicPaint" schema.
MetallicpaintPearl |  The property labeled "Pearl" from the "MetallicPaint" schema.
MetallicpaintPearlAmount |  The property labeled "Amount" from the "MetallicPaint" schema.
MetallicpaintPearlColor |  The property labeled "Color" from the "MetallicPaint" schema.
MetallicpaintPearlColorByObject |  The property labeled "Color By Object" from the "MetallicPaint" schema.
MetallicpaintPearlIor |  The property labeled "Blend" from the "MetallicPaint" schema.
MetallicpaintTopcoat |  The property labeled "Top Coat" from the "MetallicPaint" schema.
MetallicpaintTopcoatFalloff |  The property labeled "Angle Falloff" from the "MetallicPaint" schema.
MetallicpaintTopcoatGlossy |  The property labeled "Glossiness" from the "MetallicPaint" schema.
Top
See Also
Reference
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace